<a href="https://colab.research.google.com/github/Santhoshstark06/.github/blob/main/Reunion_SQL.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [2]:
import sqlite3

conn = sqlite3.connect('test.db')
print("Opened database successfully");

conn.execute('''CREATE TABLE products (
    product_id INT PRIMARY KEY,
    product_name VARCHAR(255)
);''')

conn.commit()

print("Table created successfully");

Opened database successfully
Table created successfully

In [3]:
conn.execute('''CREATE TABLE product_variants (
    variant_id INT PRIMARY KEY,
    product_id INT,
    variant_name VARCHAR(255),
    FOREIGN KEY (product_id) REFERENCES products(product_id)
);''')

conn.commit()

print("Table created successfully");

Table created successfully

In [4]:
conn.execute('''CREATE TABLE customers (
    customer_id INT PRIMARY KEY,
    customer_name VARCHAR(255),
    shipping_address VARCHAR(255),
    contact_number VARCHAR(20)
);''')

conn.commit()

print("Table created successfully");

Table created successfully

In [5]:
conn.execute('''CREATE TABLE orders (
    order_id INT PRIMARY KEY,
    customer_id INT,
    order_date DATE,
    order_amount DECIMAL(10, 2),
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);''')

conn.commit()

print("Table created successfully");

Table created successfully

In [6]:
conn.execute('''CREATE TABLE order_items (
    item_id INT PRIMARY KEY,
    order_id INT,
    variant_id INT,
    quantity INT,
    FOREIGN KEY (order_id) REFERENCES orders(order_id),
    FOREIGN KEY (variant_id) REFERENCES product_variants(variant_id)
);''')

conn.commit()

print("Table created successfully");

Table created successfully

In [7]:
conn.execute('''INSERT INTO products (product_id, product_name)
VALUES
    (1, 'Product A'),
    (2, 'Product B'),
    (3, 'Product C'),
    (4, 'Product D'),
    (5, 'Product E'),
    (6, 'Product F'),
    (7, 'Product G'),
    (8, 'Product H'),
    (9, 'Product I'),
    (10, 'Product J');
''')

conn.execute('''INSERT INTO product_variants (variant_id, product_id, variant_name)
VALUES
    (1, 1, 'Variant 1'),
    (2, 1, 'Variant 2'),
    (3, 2, 'Variant 1'),
    (4, 2, 'Variant 2'),
    (5, 3, 'Variant 1'),
    (6, 3, 'Variant 2'),
    (7, 4, 'Variant 1'),
    (8, 5, 'Variant 1'),
    (9, 6, 'Variant 1'),
    (10, 7, 'Variant 1'),
    (11, 7, 'Variant 2'),
    (12, 7, 'Variant 3'),
    (13, 8, 'Variant 1'),
    (14, 9, 'Variant 1'),
    (15, 9, 'Variant 2'),
    (16, 9, 'Variant 3'),
    (17, 10, 'Variant 1');
''')

conn.execute('''INSERT INTO customers (customer_id, customer_name, shipping_address, contact_number)
VALUES
    (1, 'John Doe', '123 Main St, City', '123-456-7890'),
    (2, 'Jane Smith', '456 Elm St, City', '987-654-3210'),
    (3, 'Alice Johnson', '789 Oak St, City', '555-555-5555'),
    (4, 'Michael Brown', '567 Pine St, City', '111-222-3333'),
    (5, 'Sarah Wilson', '789 Maple St, City', '444-555-6666'),
    (6, 'David Davis', '234 Oak St, City', '777-888-9999'),
    (7, 'Emily Taylor', '890 Elm St, City', '000-111-2222'),
    (8, 'Andrew Clark', '456 Walnut St, City', '333-444-5555'),
    (9, 'Olivia Anderson', '345 Cedar St, City', '666-777-8888'),
    (10, 'Sophia Allen', '901 Birch St, City', '999-000-1111');
''')

conn.execute('''INSERT INTO orders (order_id, customer_id, order_date, order_amount)
VALUES
    (1, 1, '2023-01-01', 100.00),
    (2, 1, '2023-02-15', 150.00),
    (3, 2, '2023-03-10', 75.00),
    (4, 2, '2023-05-20', 200.00),
    (5, 3, '2023-06-05', 50.00),
    (6, 3, '2023-07-10', 300.00),
    (7, 4, '2023-01-20', 80.00),
    (8, 4, '2023-04-05', 120.00),
    (9, 5, '2023-06-15', 250.00),
    (10, 5, '2023-07-01', 180.00),
    (11, 6, '2023-02-28', 90.00),
    (12, 6, '2023-06-30', 200.00),
    (13, 7, '2023-03-15', 70.00),
    (14, 7, '2023-04-20', 300.00),
    (15, 8, '2023-05-10', 180.00),
    (16, 9, '2023-05-25', 120.00),
    (17, 9, '2023-07-05', 250.00),
    (18, 10, '2023-03-01', 150.00),
    (19, 10, '2023-07-12', 220.00);
''')

conn.execute('''INSERT INTO order_items (item_id, order_id, variant_id, quantity)
VALUES
    (1, 1, 1, 2),
    (2, 1, 2, 3),
    (3, 2, 1, 1),
    (4, 2, 2, 2),
    (5, 3, 3, 2),
    (6, 4, 4, 4),
    (7, 5, 5, 3),
    (8, 6, 6, 1),
    (9, 6, 7, 2),
    (10, 7, 8, 3),
    (11, 8, 9, 2),
    (12, 9, 10, 5),
    (13, 10, 11, 1),
    (14, 11, 12, 2),
    (15, 12, 13, 3),
    (16, 12, 14, 1),
    (17, 13, 15, 2),
    (18, 13, 16, 4),
    (19, 14, 17, 3),
    (20, 14, 2, 1),
    (21, 15, 3, 2),
    (22, 15, 4, 3),
    (23, 16, 5, 1),
    (24, 16, 6, 2),
    (25, 17, 7, 3),
    (26, 17, 8, 1),
    (27, 18, 9, 2),
    (28, 18, 10, 4),
    (29, 19, 11, 3),
    (30, 19, 12, 1);
''')

conn.commit()

print("Data inserted successfully");

Data inserted successfully

In [8]:
conn.execute('''INSERT INTO orders (order_id, customer_id, order_date, order_amount)
VALUES
    (1, 1, '2023-01-01', 100.00),
    (2, 1, '2023-02-15', 150.00),
    (3, 2, '2023-03-10', 75.00),
    (4, 2, '2023-05-20', 200.00),
    (5, 3, '2023-06-05', 50.00),
    (6, 3, '2023-07-10', 300.00),
    (7, 4, '2023-01-20', 80.00),
    (8, 4, '2023-04-05', 120.00),
    (9, 5, '2023-06-15', 250.00),
    (10, 5, '2023-07-01', 180.00),
    (11, 6, '2023-02-28', 90.00),
    (12, 6, '2023-06-30', 200.00),
    (13, 7, '2023-03-15', 70.00),
    (14, 7, '2023-04-20', 300.00),
    (15, 8, '2023-05-10', 180.00),
    (16, 9, '2023-05-25', 120.00),
    (17, 9, '2023-07-05', 250.00),
    (18, 10, '2023-03-01', 150.00),
    (19, 10, '2023-07-12', 220.00),
    (20, 1, '2022-03-10', 120.00),
    (21, 2, '2022-04-05', 90.00),
    (22, 3, '2022-05-15', 150.00),
    (23, 4, '2022-06-20', 200.00),
    (24, 5, '2022-07-05', 80.00),
    (25, 6, '2022-08-15', 110.00),
    (26, 7, '2022-09-10', 70.00),
    (27, 8, '2022-10-25', 180.00),
    (28, 9, '2022-11-20', 130.00),
    (29, 10, '2022-12-05', 160.00);
''')

conn.commit()

print("Data inserted successfully");

IntegrityError: ignored

In [9]:
# 1. Retrieve the top 5 customers who have made the highest average order amounts in the last 6 months. The average order amount should be calculated for each customer, and the result should be sorted in descending order.

cursor = conn.execute('''SELECT c.customer_id, c.customer_name, AVG(o.order_amount) AS average_order_amount
FROM customers c
JOIN orders o ON c.customer_id = o.customer_id
WHERE o.order_date >= date('now', '-6 months')
GROUP BY c.customer_id, c.customer_name
ORDER BY average_order_amount DESC
LIMIT 5;
''')

for row in cursor:
  print(row)

(5, 'Sarah Wilson', 215.0)
(7, 'Emily Taylor', 185.0)
(9, 'Olivia Anderson', 185.0)
(10, 'Sophia Allen', 185.0)
(8, 'Andrew Clark', 180.0)

In [12]:
# 2. Retrieve the list of customer whose order value is lower this year as compared to previous year.

cursor = conn.execute('''SELECT c.customer_id, c.customer_name
FROM customers c
JOIN orders o1 ON c.customer_id = o1.customer_id
JOIN orders o2 ON c.customer_id = o2.customer_id
WHERE strftime('%Y', o1.order_date) = strftime('%Y', 'now', '-1 year')
  AND strftime('%Y', o2.order_date) = strftime('%Y', 'now')
GROUP BY c.customer_id, c.customer_name
HAVING SUM(o2.order_amount) < SUM(o1.order_amount);
''')

for row in cursor:
  print(row)

In [11]:
conn.execute('''CREATE TABLE cumulative_purchase (
    customer_id INTEGER,
    order_date DATE,
    cumulative_amount NUMERIC,
    PRIMARY KEY (customer_id, order_date),
    FOREIGN KEY (customer_id) REFERENCES customers(customer_id)
);
''')

conn.commit()

print("Table created successfully")

Table created successfully

In [13]:
conn.execute('''INSERT INTO cumulative_purchase (customer_id, order_date, cumulative_amount)
SELECT
    o.customer_id,
    o.order_date,
    SUM(o2.order_amount) AS cumulative_amount
FROM
    orders o
JOIN
    orders o2 ON o.customer_id = o2.customer_id AND o.order_date >= o2.order_date
GROUP BY
    o.customer_id,
    o.order_date;
''')

conn.commit()

print("Data inserted successfully")

Data inserted successfully

In [14]:
# 3. Create a table showing cumulative purchase by a particular customer.

# NOTE: Creation of this table and inserting values into it has been done in the previous two queries.

cursor = conn.execute("SELECT * FROM cumulative_purchase;")

for row in cursor:
  print(row)

(1, '2023-01-01', 100)
(1, '2023-02-15', 250)
(2, '2023-03-10', 75)
(2, '2023-05-20', 275)
(3, '2023-06-05', 50)
(3, '2023-07-10', 350)
(4, '2023-01-20', 80)
(4, '2023-04-05', 200)
(5, '2023-06-15', 250)
(5, '2023-07-01', 430)
(6, '2023-02-28', 90)
(6, '2023-06-30', 290)
(7, '2023-03-15', 70)
(7, '2023-04-20', 370)
(8, '2023-05-10', 180)
(9, '2023-05-25', 120)
(9, '2023-07-05', 370)
(10, '2023-03-01', 150)
(10, '2023-07-12', 370)

In [15]:
# 4. Retrieve the list of top 5 selling products. Further bifurcate the sales by product variants.

cursor = conn.execute('''SELECT p.product_id, p.product_name, pv.variant_name, SUM(oi.quantity) AS total_quantity
FROM products p
JOIN product_variants pv ON p.product_id = pv.product_id
JOIN order_items oi ON pv.variant_id = oi.variant_id
GROUP BY p.product_id, p.product_name, pv.variant_name
ORDER BY total_quantity DESC
LIMIT 5;
''')

for row in cursor:
  print(row)

(7, 'Product G', 'Variant 1', 9)
(2, 'Product B', 'Variant 2', 7)
(1, 'Product A', 'Variant 2', 6)
(4, 'Product D', 'Variant 1', 5)
(2, 'Product B', 'Variant 1', 4)